; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	image1 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Star0 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Phenomenon20 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Planet9 image1)
	(have_image Phenomenon10 image1)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 spectrograph0)
	(have_image Star17 spectrograph0)
	(have_image Phenomenon18 image1)
	(have_image Star19 spectrograph0)
	(have_image Phenomenon20 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
2. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 13
3. (turn_to satellite0 star14 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star14)
   goals met: 0 of 13
4. (take_image satellite0 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 1 of 13
5. (turn_to satellite0 planet15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet15)
   goals met: 1 of 13
6. (take_image satellite0 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 2 of 13
7. (turn_to satellite0 planet13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet13)
   goals met: 2 of 13
8. (take_image satellite0 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 3 of 13
9. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 3 of 13
10. (take_image satellite0 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 4 of 13
11. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 4 of 13
12. (take_image satellite0 planet11 instrument1 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 5 of 13
13. (turn_to satellite0 phenomenon16 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon16)
   goals met: 5 of 13
14. (take_image satellite0 phenomenon16 instrument1 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 6 of 13
15. (turn_to satellite0 star17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star17)
   goals met: 6 of 13
16. (take_image satellite0 star17 instrument1 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 7 of 13
17. (turn_to satellite0 star19 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star19)
   goals met: 7 of 13
18. (take_image satellite0 star19 instrument1 spectrograph0)
   added: (have_image star19 spectrograph0)
   goals met: 8 of 13
19. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 8 of 13
20. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 8 of 13
21. (turn_to satellite0 groundstation6 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 groundstation6)
   goals met: 9 of 13
22. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 9 of 13
23. (turn_to satellite0 phenomenon10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon10)
   goals met: 8 of 13
24. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 9 of 13
25. (turn_to satellite0 phenomenon18 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon18)
   goals met: 9 of 13
26. (take_image satellite0 phenomenon18 instrument0 image1)
   added: (have_image phenomenon18 image1)
   goals met: 10 of 13
27. (turn_to satellite0 phenomenon20 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon20)
   goals met: 10 of 13
28. (take_image satellite0 phenomenon20 instrument0 image1)
   added: (have_image phenomenon20 image1)
   goals met: 11 of 13
29. (turn_to satellite0 planet9 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 planet9)
   goals met: 11 of 13
30. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 12 of 13
31. (turn_to satellite0 groundstation6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation6)
   goals met: 13 of 13
